// 千分位 分隔符
// 将 '10000000000' 形式的字符串，
// 以每 3 位进行分隔展示 '10.000.000.000'

// 方法一: 德国以 . 分割金钱, 转到德国当地格式化方案即可
console.log(10000000000..toLocaleString('de-DE') ); // 10.000.000.000
console.log(100000000..toLocaleString('de-DE') ); // 100.000.000
console.log(10000000.0000.toLocaleString('de-DE') ) // 10.000.000
// 说明这个方法会主动把小数点后面的去掉，如果需要，则使用其他方法补上，比如toFixed等等

// 方法二：寻找字符空隙加 这个方法只适合没有小数点的
let a = '10000000000'.replace(/\B(?=(\d{3})+(?!\d))/g, '.');
// 10.000.000.000
let b = '10000000000.0000'.replace(/(\d)(?=(\d{3})+\b)/g, '$1.');
console.log('b', b); // 10.000.000.000.0.000 所以只适合没有小数点的
